#

#


#
print("===================SyntaxError 만들기====================")

# print("온도) # 따옴표를 안닫음
# print"진동" # 괄호를 안닫음

print("온도")  # 따옴표를 안닫음
print("진동")  # 괄호를 안닫음

# print(온도, 75) # 따옴표 누락
# print("진동", 2.3 # 괄호 누락
# print("압력": 4.0) # 잘못된 따옴표 위치, 쉼표 누락

print("온도", 75)
print("진동", 2.3)
print("압력:", 4.0)


# =================================================================
print("======================실습-점검 리포트 안내=========================")
print("====", 1, "번" + "설비" + "점검" + "====")
print("온도(℃):", 40 * 2 + 2)  # 특수문자(이모지): 윈도우키 + ;
print("온도 " + "상승량:", 1 + 1 + 2 + 3 + 5 - 1)

