# 변수 선언 방법
# 변수이름 = 값
# 오른쪽 값을 왼쪽 이름에 "저장"하라는 코드
temp = 36  # 숫자로 저장하고 싶다면 따옴표 금지
name = "센서 A"  # 글자는 무조건 따옴표로 감싸기

print(temp)  # 36
print(t"emp")  # temp

# = 은 "같다"가 아니라 "저장"하는 것
# 비교는 == 을 사용

# ===============================
print("========= 변수 사용 활용 ==========")

x = 5
# 변수를 "재할당"할 때 변수 기존 자신의 값을 활용할 수 있음
# 변수에 할당할 때
x = x + 5
print(x)  # 10

# y = y + 5  # 오류 발생, y가 선언되지 않았기 때문

# ===================================
print("====== 재할당 =======")

print("재할당하기 전 temp:", temp)
temp = 15  # 위에서 할당했던 36이라는 값을 15로 재할당(수정)
Temp = 15  # temp와 다른 변수로 동작
print("temp: ", temp)
print("Temp: ", Temp)

# 재할당은 지금까지 실행된 코드 중 가장 마지막으로 저장된 값이 불려옴
# print(score) # NameError 발생
score = 10
print(score)  # 10
score = 20
score = 30
print(score)  # 30

# ========================================
print("=============== 값 복사 ===================")

a = 10
b = a  # b 변수에는 10이 저장 (저장할 때의 그 순간의 a 값을 b에 복사)
a = 100  # a 변수를 재할당해도
print(b)  # 10 b 변수의 값은 10이 그대로 유지됨

# ========================================
print("====== 여러 변수 한 번에 선언 및 할당 =========")

# 형식: 변수1, 변수2, ... = 값1, 값2, ... < 변수와 값이 갯수가 같아야 함

width, height = 10, 20  # width는 10, hight는 20이 할당
print("width:", width, "height:", height)

# x, y, z = 10, 20  # 변수 3개, 값 2개 > valueError 발생

# ========================================
print("======== 주석으로 변수 설명 ========")

temp = 25  # 온도(섭씨)
count = 3  # 센서 개수
# temp = 10000000000000 # 주석처리된 코드는 동작하지 않음
print(temp)  # 25

# ========================================
print("==== 실습1, 변수 만들고 출력하기 =====")
temp = 25
print(temp)
name = "센서A"
print(name)

# ========================================
print("==== 실습2, 변수 재할당하기 =====")
temp = 30
print(temp)
temperature = temp
print(temperature)

# ========================================
print("==== 실습3, 직접변수 만들고 출력하기 =====")
my_number = 4
print(my_number)
mood = "애매모호"
print(mood)

# ========================================
print("==== 실습4, 나이 점수 개수 변수로 표현 =====")
age = 32
score = 4
label = "나이"
print(label)
print(age)

# ========================================
print("==== 실습5, 변수 값 바꿔가며 추적하기 =====")
x = 10  # print(x) : 10
x = x + 5
print(x)
x = x * 2
print(x)

# ========================================
print("==== 실습6, 두 변수 값 옮기고 바꾸기 =====")
a = 100
b = a
a = 999
print(a)
print(b)

# ========================================
print("==== 실습7, 일부러 오류 내고 고치기 =====")
temp = 25
print(temp)
score = 90
print(score)

# ========================================
print("==== 실습8, 주석으로 변수 설명 달기 =====")
temp = 25  # 온도(섭씨)
count = 3  # 센서 개수
# temp =100
print(temp)

# ========================================
print("==== 실습9, 값 예측 미니 퀴즈 =====")
x = 5
x = 10
x = x + 1
print(x)  # 11

# ========================================
print("==== 실습10, 정보 카드 만들기(종합) =====")
# 주제 = 이름, 나이
name = "김태구"
temp = 32
print("이름")
print(name)
print(temp)

# ========================================
print("==== 실습11, 변수 이름 다듬기 =====")
a = 25
b = 3
device_temp = 25
sensor_count = 3
print(device_temp)
print(sensor_count)

# ========================================
print("==== 실습12, 변수 한 줄 만들기 도전 =====")
# x, y, z = 1, 2  # 오류 발생
x, y, z = 1, 2, 3
width, height = 4, 3
print(width), print(height)
