# 산술 연산자
# + _ * / //(몫) %(나머지) **(거듭제곱)
print(3 + 5)  # 8
print(10 - 4)  # 6
print(4 * 5)  # 20
print(20 / 4)  # 5.0 (나눗셈 결과는 항상 float)
print(7 // 3)  # 2 (나눗셈 결과의 몫)
# 7개의 음료수를 3봉투에 나눠 담으면, 2봉투와 1개의 음료수가 남음
print(7 % 3)  # 1 (나눗셈 결과의 나머지)
print(2**5)  # 32 (2의 5제곱)

# =================================
# 연산 우선순위와 우선순위 지정

# **(거듭제곱) > *(곱하기) /(나누기) //(몫) %(나머지) > +(더하기) -(빼기)

print(2 + 8 * 3)  # 8*3 연산 후 그 결과를 2와 더함
print((2 + 8) * 3)  # 괄호 안의 연산을 먼저 한 뒤 곱하기 계산

# =================================
# 복합연산자

result = 3 * 5
print(result)  # 15

# +=: 기존 값에서 오른쪽 값을 더한 뒤 재할당
# -=: 기존 값에서 오른쪽 값을 뺀 뒤 재할당
# *=: 기존 값에서 오른쪽 값을 곱한 뒤 재할당
# /=: 기존 값에서 오른쪽 값을 나눈 뒤 재할당

result += 10  # 25
print(result)
result -= 5  # 20
print(result)
result *= 3  # 60
print(result)
result /= 2  # 30.0
print(result)

# =============================
# 문자열 연산
print("안녕" + "하세요")  # 안녕하세요

# 만약 "안녕"과 "하세요" 사이에 공백을 1개 넣고 싶다면
# 방법 1) , 사용
print("안녕", "하세요")
# 방법 2) 안녕 뒤에 공백 추가
print("안녕 " + "하세요")
# 방법 3) 공백만 있는 문자열 더하기
print("안녕" + " " + "하세요")

# 문자열 곱하기
print("안녕" * 5)  # 안녕안녕안녕안녕안녕

# 문자열에 연산자를 사용할 경우 모두 이어져서 나옴

# ====================
print("실습01 사칙연산 계산기(코드)")
a = 17
b = 5
print(a + b)  # 22
print(a - b)  # 12
print(a * b)  # 85
print(a / b)  # 3.4
print(a // b)  # 3
print(a % b)  # 2
print(a**b)  # 1419857


# ======================
print("실습02 평균과 도형 계산 응용")
# 목표 여러 수로 평균 정사각형 넓이 직육면체 부피를 계산
# 단계 1. 점수 3개 저장 -> 2. 평균(합)/3 -> 3. 넓이 = 변**2, 부피 = 가로*세로*높이
# 평균 87.0 넓이49 부피60
x = 80
y = 91
z = 90
print((x + y + z) / 3)  # 87.0 (평균)
side = 7
print(side**2)  # 49 (정사각형 넓이)
print(3 * 4 * 5)  # 60 (직육면체 부피)
