# ======================================================
print("\n======================================================")

# 실습 2. update로 여러 값 한 번에 갱신하기
print("\n실습 2. update로 여러 값 한 번에 갱신하기\n")

# ======================================================
print("\n======================================================")

# 1. 센서 딕셔너리와 새 데이터 딕셔너리를 각각 저장
print("\n1. 센서 딕셔너리와 새 데이터 딕셔너리를 각각 저장\n")

sensors = {"1번센서": "A", "2번센서": "B", "3번센서": "D"}
new_data = {"1번센서": "C"}
print(sensors)  # {'1번센서': "A", '2번센서': "B", "3번센서": "D"}
print(new_data)  # {'1번센서': "C"}

# -----------------------------------------------
print("\n-----------------------------------------------")

# 2. update로 새 데이터를 한 번에 반영(있으면 수정, 없으면 추가)
print("\n2. update로 새 데이터를 한 번에 반영(있으면 수정, 없으면 추가)\n")

sensors.update(new_data)
print(sensors)  # {'1번센서': "C", '2번센서': "B", '3번센서': "D"}

# -----------------------------------------------
print("\n-----------------------------------------------")

# 3. del로 특정 키를 삭제하고 len으로 개수 확인
print("\n3. del로 특정 키를 삭제하고 len으로 개수 확인\n")

del sensors["2번센서"]
print(len(sensors))


# ======================================================
print("\n======================================================")

# 실습 4. zip으로 센서명-값 매핑하기
print("\n실습 4. zip으로 센서명-값 매핑하기\n")

# ======================================================
print("\n======================================================")

# 1. 센서명 리스트와 측정값 리스트를 각각 저장
print("\n1. 센서명 리스트와 측정값 리스트를 각각 저장")

sensor_name = ["온도", "진동", "압력"]
values = [78, 0.5, 95]

# -----------------------------------------------
print("\n-----------------------------------------------")

# 2. zip으로 두 리스트를 짝지어 dict로 변환
print("\n2. zip으로 두 리스트를 짝지어 dict로 변환\n")

sensors = dict(zip(sensor_name, values))
print(sensors)

# -----------------------------------------------
print("\n-----------------------------------------------")

# 3. items로 순회하며 이름-값 쌍 출력
print("\nitems로 순회하며 이름-값 쌍 출력\n")

for sensor_name, value in sensors.items():
    print(sensor_name)
    print(value)
