# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

print("실습 2. 임계값 넘는 설비 골라내기")
# 실습 2. 임계값 넘는 설비 골라내기

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 목표
# 실제 제조 데이터에서 위험 임계값을 넘는 설비 추출

import pandas as pd

df = pd.read_csv("data/13_diecasting_small.csv")
print("== df.info() 실행 ==\n")
df.info()


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 단계
# 비스킷두께 열에 비교 연산자로 임계값 기준 조건 생성
c = df["비스킷두께"] >= 16
print("== c.info() 실행 ==\n")
c.info()

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 조건을 대괄호에 넣어 임계값 초과 설비만 추출
df_c = df[c]
print("== df_c.info() 실행 ==\n")
df_c.info()

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 결과에서 샷와 비스킷두께 열만 골라 확인
print('== df_c[["샷", "비스킷두께"]] 출력 ==\n')
print(df_c[["샷", "비스킷두께"]])

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")
