# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ln = f"\n{"~" * 30}\n"
print(ln)

# 실습 6. 최빈값·앞뒤 값 대체
print("실습 6. 최빈값·앞뒤 값 대체")

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)

# 범주형은 최빈값, 시계열은 앞뒤 값으로 채우기

import pandas as pd

df = pd.read_csv("data/15_02_사출성형_공정.csv", encoding="utf-8")


# 목표
# 범주형은 최빈값, 시계열은 앞뒤 값으로 채우기

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# 단계
# 범주형 열의 최빈값을 구해 채우기
print("==[ 범주형 열의 최빈값을 구해 채우기 ]==\n")
# 사출기 컬럼은 1호기~3호기 범주형으로 판단
print(df["사출기"].isna().sum())  # 0

print(f"\n{"~ "*10}\n")
print(df["사출기"].mode()[0])  # 1호기가 가장 많다고 함

print(f"\n{"~ "*10}\n")
df["사출기"].fillna(df["사출기"].mode()[0])
print(df["사출기"].isna().sum())  # 0


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)

# 측정시각 순으로 정렬해 시계열 순서 만들기
print("==[ 측정시각 순으로 정렬해 시계열 순서 만들기 ]==\n")
df = df.sort_values("측정시각")

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)

# ffill로 앞 값, bfill로 남은 앞쪽 결측까지 채우기
print("==[ ffill로 앞 값, bfill로 남은 앞쪽 결측까지 채우기 ]==\n")
print(df["전환압력"].isna().sum())  # 68개 NaN 확인

print(f"\n{"~ "*10}\n")
df["전환압력"] = df["전환압력"].ffill().bfill()  # 자주 볼 시계열 채우기 패턴
print(df["전환압력"].isna().sum())  # 0개 NaN 확인

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)
