# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

print("실습 3. 두 조건 묶기")
# 실습 3. 두 조건 묶기

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 목표
# 두 조건을 그리고(&)·또는(|)로 묶어 행을 추출

import pandas as pd

df = pd.read_csv("data/13_diecasting_small.csv")
print("== df.info() 실행 ==\n")
df.info()


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 단계
# 비스킷두께 조건과 사이클타임 조건을 각각 괄호로 감싸기
df_1 = df["비스킷두께"] >= 12
df_2 = df["사이클타임"] >= 20
df_1.info()
df_2.info()

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 두 조건을 그리고 기호(&)로 묶어 모두 만족하는 행 추출
df_both = df[(df["비스킷두께"] >= 12) & (df["사이클타임"] >= 20)]
print("== df_both.info() 실행 ==\n")
df_both.info()

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 같은 두 조건을 또는 기호(|)로 묶어 결과 수 비교
df_eigher = df[(df["비스킷두께"] >= 12) | (df["사이클타임"] >= 20)]
print("== df_eigher.info() 실행 ==\n")
df_eigher.info()


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")
