# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ln = f"\n{"~" * 30}\n"
print(ln)

print("실습 2. 한 컬럼의 최소·최대·범위")
# 실습 2. 한 컬럼의 최소·최대·범위

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)

# 실린더압력의 양 끝값과 범위로 퍼짐 확인

import pandas as pd

df = pd.read_csv("data/16_diecasting.csv", encoding="utf-8")


# 목표
# 한 컬럼의 최솟값·최댓값·범위를 구해 퍼짐 확인

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# 단계
# 실린더압력 열의 최솟값 구하기
print("==[ 실린더압력 열의 최솟값 구하기 ]==\n")
df_min = df["실린더압력"].min()
print(df_min)

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)

# 실린더압력 열의 최댓값 구하기
print("==[ 실린더압력 열의 최댓값 구하기 ]==\n")
df_max = df["실린더압력"].max()
print(df_max)


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)

# 최댓값에서 최솟값을 빼 범위 계산
print("==[ 최댓값에서 최솟값을 빼 범위 계산 ]==\n")
print(df_max - df_min)

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(ln)
