# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

print("실습 4. 부정·목록·범위 조건")
# 실습 4. 부정·목록·범위 조건

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 목표
# 부정·목록 매칭·범위 조건을 각각 적용

import pandas as pd

df = pd.read_csv("data/13_diecasting_small.csv")
print("== df.info() 실행 ==\n")
df.info()


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# 단계
# 물결 기호로 고장이 아닌 설비만 뒤집어 추출
# 양품 / 불량
print('== df[df["품질등급"] == "불량"].head(4) 출력 ==\n')
print(df[df["품질등급"] == "불량"].head(4))

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# isin으로 품질등급이 특정 목록에 속하는 행 추출
print('== df[df["품질등급"].isin(["양품"])].head(4) 출력 ==\n')
print(df[df["품질등급"].isin(["양품"])].head(4))

# ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~
print(f"\n{"~ " * 15}\n")

print('== df[df["품질등급"].isin(["주의"])].head(4) 출력 ==\n')
print(df[df["품질등급"].isin(["주의"])].head(4))

# ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~
print(f"\n{"~ " * 15}\n")

print('== df[df["품질등급"].isin(["양품", "주의"])].head(4) 출력 ==\n')
print(df[df["품질등급"].isin(["양품", "주의"])].head(4))


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")

# between으로 실린더압력가 지정 범위에 든 행 추출
print('== df[df["실린더압력"].between(200, 240)].head(8) 출력 ==\n')
print(df[df["실린더압력"].between(200, 240)].head(8))


# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
print(f"\n{"~" * 30}\n")
